src/Documents/ПеремещениеТоваров/ПеремещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="050b09a5-e36c-42b6-b337-cdddd2968bea">
  <name>ПеремещениеТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ax_КомментарийСклад</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ax_Отгрузил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ax_ОтгрузилДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ax_Проверил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ax_ПроверилДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ax_УС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="6cf61f94-1052-4a7d-8b0c-3ca30671d5b1">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8f8abbfa-b9cf-4125-94d5-4bb7574640ca">
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1cb22b8e-041e-4f12-bc43-4bfb145592f3">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ax_МаксимальныйКодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="9245a6b4-8e2f-4305-bf6d-a6b67568f8f3">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ee97939f-4b30-4520-9e85-ad37d0c0b7b9">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ax_ОтправитьВУСНепроведенным</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="1e1ffb49-bf3a-4fd2-b186-b16be6fe8096">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f945ba8c-cdb8-4782-a03f-342514b50ad3">
    <name>СкладОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="021db3c3-dccb-4cee-a6a4-de5688202aa5">
    <name>СкладПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9c3cea07-4601-4982-94f2-9dbde0d6a9fd">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b2d564e7-ff07-49ec-9eec-93f796ebb1e8">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ax_ПроверенСкладом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="ec1f4519-6787-456f-8137-6e0249afc4c8">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4a32dceb-9f97-4017-97bb-fdde719e559b">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2167a38d-255f-4c25-8f24-b24e020c3aff">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5cca2552-e19e-4745-9c8d-4be56a5d9b55">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9d729a90-016a-4d7c-b436-f809080e3bc1">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ax_КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПеремещениеТоваров/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ax_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ГруппаСтраницы = Элементы.Найти("ГруппаСтраницы");
	
	СтраницаБригады = Элементы.Добавить("ТДФ1_ГруппаБригады", Тип("ГруппаФормы"), ГруппаСтраницы);
	СтраницаБригады.Вид = ВидГруппыФормы.Страница;
	СтраницаБригады.ОтображатьЗаголовок = Истина;
	СтраницаБригады.Заголовок = "Бригады";
	
	ПоляФормы = Новый Массив;
	
	ТабличноеПолеПроверил = Элементы.Добавить("ax_Проверил", Тип("ПолеФормы"), СтраницаБригады);
	ТабличноеПолеПроверил.ПутьКДанным = "Объект.ax_Проверил";
	ТабличноеПолеПроверил.Видимость = Истина;
	ТабличноеПолеПроверил.Вид = ВидПоляФормы.ПолеВвода;
	ТабличноеПолеПроверил.Заголовок = "Проверил"; 
	ТабличноеПолеПроверил.РежимВыбораИзСписка = Истина;
	ТабличноеПолеПроверил.КнопкаСоздания = Ложь;
	ТабличноеПолеПроверил.УстановитьДействие("ПриИзменении", "ПроверилПриИзменении");
	ПоляФормы.Добавить(ТабличноеПолеПроверил);
	
	ТабличноеПолеОтгрузил = Элементы.Добавить("ax_Отгрузил", Тип("ПолеФормы"), СтраницаБригады);
	ТабличноеПолеОтгрузил.ПутьКДанным = "Объект.ax_Отгрузил";
	ТабличноеПолеОтгрузил.Видимость = Истина;
	ТабличноеПолеОтгрузил.Вид = ВидПоляФормы.ПолеВвода;
	ТабличноеПолеОтгрузил.Заголовок = "Отгрузил";
	ТабличноеПолеОтгрузил.РежимВыбораИзСписка = Истина;
	ТабличноеПолеОтгрузил.КнопкаСоздания = Ложь;
	ТабличноеПолеОтгрузил.УстановитьДействие("ПриИзменении", "ОтгрузилПриИзменении");
	ПоляФормы.Добавить(ТабличноеПолеОтгрузил);
	
	ax_АдаптацияИнтерфейса.ИнициализироватьСписокВыбораПолейФормы(ПоляФормы);
	
	ЭлементСтраницаОсновное = Элементы.Найти("СтраницаОсновное");
	
	ГруппаПараметрыОбменаОсновная = Элементы
		.Добавить("ax_ГруппаПараметрыОбменаОсновная", Тип("ГруппаФормы"), ЭлементСтраницаОсновное );
	ГруппаПараметрыОбменаОсновная.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПараметрыОбменаОсновная.ОтображатьЗаголовок = Истина;
	ГруппаПараметрыОбменаОсновная.Заголовок = "ТД Форт (параметры обмена с WMS)";
	ГруппаПараметрыОбменаОсновная.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
	ГруппаПараметрыОбменаОсновная.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаПараметрыОбменаОсновная.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
		
	ЭлементУС = Элементы.Добавить("ax_УС", Тип("ПолеФормы"), ГруппаПараметрыОбменаОсновная);
	ЭлементУС.ПутьКДанным = "Объект.ax_УС";
	ЭлементУС.Видимость = Истина;
	ЭлементУС.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементУС.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементУС.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементУС.Заголовок = "Отправить в УС";
	ЭлементУС.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ЭлементОтправитьВУСНепроведенным = Элементы
		.Добавить("ax_ОтправитьВУСНепроведенным", Тип("ПолеФормы"), ГруппаПараметрыОбменаОсновная);
	ЭлементОтправитьВУСНепроведенным.ПутьКДанным = "Объект.ax_ОтправитьВУСНепроведенным";
	ЭлементОтправитьВУСНепроведенным.Видимость = Истина;
	ЭлементОтправитьВУСНепроведенным.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементОтправитьВУСНепроведенным.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементОтправитьВУСНепроведенным.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементОтправитьВУСНепроведенным.Заголовок = "Отправить в УС непроведенным";
	ЭлементОтправитьВУСНепроведенным.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ЭлементПроверенСкладом = Элементы
		.Добавить("ax_ПроверенСкладом", Тип("ПолеФормы"), ГруппаПараметрыОбменаОсновная);
	ЭлементПроверенСкладом.ПутьКДанным = "Объект.ax_ПроверенСкладом";
	ЭлементПроверенСкладом.Видимость = Истина;
	ЭлементПроверенСкладом.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементПроверенСкладом.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементПроверенСкладом.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементПроверенСкладом.Заголовок = "Проверен складом";
	ЭлементПроверенСкладом.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ЭлементКомментарийСклад = Элементы
		.Добавить("ax_КомментарийСклад", Тип("ПолеФормы"), ГруппаПараметрыОбменаОсновная);
	ЭлементКомментарийСклад.ПутьКДанным = "Объект.ax_КомментарийСклад";
	ЭлементКомментарийСклад.Видимость = Истина;
	ЭлементКомментарийСклад.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементКомментарийСклад.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементКомментарийСклад.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементКомментарийСклад.Заголовок = "Комментарий для склада";
	ЭлементКомментарийСклад.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	ЭлементКомментарийСклад.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх; 
	ЭлементКомментарийСклад.РастягиватьПоГоризонтали = Истина;
	ЭлементКомментарийСклад.МногострочныйРежим = Истина;
	ЭлементКомментарийСклад.Ширина = 76;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверилПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ax_Проверил) Тогда
		ПроверилПриИзмененииСервер();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузилПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ax_Отгрузил) Тогда		
		ОтгрузилПриИзмененииСервер();		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверилПриИзмененииСервер()
	УстановитьЗначенияРеквизитовФормы(
		"Объект", 
		Новый Структура( "ax_ПроверилДата", ТекущаяДатаСеанса()), 
		Тип("ДокументОбъект.ПеремещениеТоваров"));
КонецПроцедуры

&НаСервере
Процедура ОтгрузилПриИзмененииСервер()
	УстановитьЗначенияРеквизитовФормы(
		"Объект", 
		Новый Структура( "ax_ОтгрузилДата", ТекущаяДатаСеанса()), 
		Тип("ДокументОбъект.ПеремещениеТоваров"));
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияРеквизитовФормы(ИмяРеквизитаФормы, Значения, ТипЗначения = Неопределено)
	
	ДокументОбъект = РеквизитФормыВЗначение(ИмяРеквизитаФормы,  ТипЗначения);
	ОбщегоНазначения.УстановитьЗначенияРеквизитов(ДокументОбъект, Значения);
	ЗначениеВРеквизитФормы(ДокументОбъект, ИмяРеквизитаФормы);
	
КонецПроцедуры
